podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/NVIC_STM32F030.svd.xml
<!--
Devices using this peripheral: 
      STM32F030
-->
      <peripheral>
         <?sourceFile "NVIC_STM32F030" ?>
         <name>NVIC</name>
         <description>Nested Vectored Interrupt
      Controller</description>
         <groupName>NVIC</groupName>
         <headerStructName>NVIC</headerStructName>
         <baseAddress>0xE000E100</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x80</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x180</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x300</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ISER</name>
               <description>Interrupt Set Enable Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>SETENA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICER</name>
               <description>Interrupt Clear Enable
          Register</description>
               <addressOffset>0x80</addressOffset>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>CLRENA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISPR</name>
               <description>Interrupt Set-Pending Register</description>
               <addressOffset>0x100</addressOffset>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>SETPEND</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICPR</name>
               <description>Interrupt Clear-Pending
          Register</description>
               <addressOffset>0x180</addressOffset>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>CLRPEND</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR0</name>
               <description>Interrupt Priority Register 0</description>
               <addressOffset>0x300</addressOffset>
               <fields>
                  <field>
                     <name>PRI_00</name>
                     <description>PRI_00</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_01</name>
                     <description>PRI_01</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_02</name>
                     <description>PRI_02</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_03</name>
                     <description>PRI_03</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR1</name>
               <description>Interrupt Priority Register 1</description>
               <addressOffset>0x304</addressOffset>
               <fields>
                  <field>
                     <name>PRI_40</name>
                     <description>PRI_40</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_41</name>
                     <description>PRI_41</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_42</name>
                     <description>PRI_42</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_43</name>
                     <description>PRI_43</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR2</name>
               <description>Interrupt Priority Register 2</description>
               <addressOffset>0x308</addressOffset>
               <fields>
                  <field>
                     <name>PRI_80</name>
                     <description>PRI_80</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_81</name>
                     <description>PRI_81</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_82</name>
                     <description>PRI_82</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_83</name>
                     <description>PRI_83</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR3</name>
               <description>Interrupt Priority Register 3</description>
               <addressOffset>0x30C</addressOffset>
               <fields>
                  <field>
                     <name>PRI_120</name>
                     <description>PRI_120</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_121</name>
                     <description>PRI_121</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_122</name>
                     <description>PRI_122</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_123</name>
                     <description>PRI_123</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR4</name>
               <description>Interrupt Priority Register 4</description>
               <addressOffset>0x310</addressOffset>
               <fields>
                  <field>
                     <name>PRI_160</name>
                     <description>PRI_160</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_161</name>
                     <description>PRI_161</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_162</name>
                     <description>PRI_162</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_163</name>
                     <description>PRI_163</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR5</name>
               <description>Interrupt Priority Register 5</description>
               <addressOffset>0x314</addressOffset>
               <fields>
                  <field>
                     <name>PRI_200</name>
                     <description>PRI_200</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_201</name>
                     <description>PRI_201</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_202</name>
                     <description>PRI_202</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_203</name>
                     <description>PRI_203</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR6</name>
               <description>Interrupt Priority Register 6</description>
               <addressOffset>0x318</addressOffset>
               <fields>
                  <field>
                     <name>PRI_240</name>
                     <description>PRI_240</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_241</name>
                     <description>PRI_241</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_242</name>
                     <description>PRI_242</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_243</name>
                     <description>PRI_243</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR7</name>
               <description>Interrupt Priority Register 7</description>
               <addressOffset>0x31C</addressOffset>
               <fields>
                  <field>
                     <name>PRI_280</name>
                     <description>PRI_280</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_281</name>
                     <description>PRI_281</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_282</name>
                     <description>PRI_282</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_283</name>
                     <description>PRI_283</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
